content/posts/2024-10-11-high-yield-ways-to-increase-happiness.md
+++
title = "High-yield ways to increase happiness"
author = ["Joshua Rasband"]
date = 2024-10-11
tags = ["life"]
draft = false
+++

The advertising industry usually tries to tell you that if you buy their
product or service, you will be happy.

The problem with this approach to buying happiness is that the increase in
happiness that you get from buying something will usually attenuate after a
short period of time.

Fortunately, there are more effective, longer-lasting ways to increase
happiness. They just aren't being marketed to you because there's no money in
them.


## Decrease annoyances {#decrease-annoyances}

My favorite way to improve life happiness in the long-term is to fix things that
bother me. If you're bothered about twice a week by your gate being stuck when
you want to take out the trash (as I was), it's kind of a no-brainer to take an
hour to diagnose and fix the problem.

This principle can be applied to a wide variety of annoyances. Traffic during a
morning commute. Having to make yourself breakfast every morning. An
inconvenient location for a tool that gets used regularly.

There are probably dozens of inconveniences and frustrations that you deal with
every day, and it's probably worth more than you think to eliminate those daily
annoyances. As you spend less and less of your day being annoyed, you'll be
happier and more productive. Your interpersonal relationships might also
improve, as you'll have more emotional bandwidth for dealing with interpersonal
frictions.


## Build in recurring pleasures that don't saturate {#build-in-recurring-pleasures-that-don-t-saturate}

Try to find things that you know you can get excited about every day. For me, I
will always get excited about a good meal when I'm hungry, so I try to make sure
that my meals can be a regular source of happiness in my day. I do that by
choosing high-quality ingredients and making meals that will make me happy, not
just fill my stomach.

Whatever it is that can make you happy (and not just entertained) every single
time, try to build it into your daily routine. Have a few, regularly-occurring
bright spots you can look forward to each day. It will increase your average
daily happiness in the long run.


## Think in happier ways {#think-in-happier-ways}

Happiness is a mental and emotional state. One of the most significant, but
difficult things you can do for your happiness is to try to cultivate mental and
emotional habits that facilitate happiness.

This is a complicated topic. It touches on mental illness and the limits of our
ability to control our own thoughts. For now, I think it suffices to say that
it's often possible to change the way that you think in a way that improves your
happiness. There are many frameworks for doing so.
